       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXERCICIO01.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WRK-CPF  PIC X(11) VALUE SPACES.
       77 WRK-CPF-ED PIC ZZZ.ZZZ.ZZ9/99.
       PROCEDURE DIVISION.
           ACCEPT WRK-CPF FROM CONSOLE.
           MOVE WRK-CPF TO WRK-CPF-ED.
           DISPLAY 'CPF FORMATADO... 'WRK-CPF-ED.
           STOP RUN.
