       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGCOBINSPECT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CONT1 PIC 9(2) VALUE ZEROS.
       01 WS-CONT2 PIC 9(2) VALUE ZEROS.
       01 WS-STRING PIC X(15) VALUE 'ABCDACDAFAAAFF'.

       PROCEDURE DIVISION.
           INSPECT WS-STRING TALLYING WS-CONT1 FOR CHARACTERS.
           DISPLAY 'WS-CONT1: ' WS-CONT1.
           INSPECT WS-STRING TALLYING WS-CONT2 FOR ALL 'A'.
           DISPLAY 'WS-CONT2: ' WS-CONT2.
           STOP RUN.

       END PROGRAM PROGCOBINSPECT.
